Revit 2024 API
RebarBendingDetailType.DetailLevel Property
 Identifies the level of detail in which the Bending Detail will be represented.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public BendingDetailLevelOfDetail DetailLevel { get; set; }
Visual Basic
Public Property DetailLevel As BendingDetailLevelOfDetail
	Get
	Set
Visual C++
public:
property BendingDetailLevelOfDetail DetailLevel {
	BendingDetailLevelOfDetail get ();
	void set (BendingDetailLevelOfDetail value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
RebarBendingDetailType Class
Autodesk.Revit.DB.Structure Namespace